namespace ZMotionSDK;

public class ErrorCode
{
    public static string Parse(int errorCode)
    {
        return errorCode switch
        {
            2033 => "表达式中碰到不认识的名称。",
            3206 => "内部调用参数错误",
            20002 => "参数错",
            20003 => "超时",
            20006 => "操作系统错误",
            20007 => "串口打开失败",
            20008 => "网络打开失败",
            20009 => "句柄错误",
            20010 => "发送错误",
            20011 => "文件错误",
            20012 => "文件长度错误",
            20013 => "文件名过长",
            20014 => "文件不存在",
            20015 => "ZLB 库文件错误",
            20016 => "文件没有编译",
            20020 => "固件文件不匹配",
            20021 => "不支持的功能",
            20030 => "输入缓冲长度不够",
            20100 => "应答缓冲长度不够",
            30000 => "无应答",
            30001 => "应答错误",
            30002 => "参数错误",
            30003 => "不支持",
            30004 => "文件参数错误",
            30005 => "OS错误",
            30006 => "单词发送数据超限",
            _ => $"ErrorCode:{errorCode};未知错误",
        };
    }
}